performance-test-config.yaml
config:
  target: http://10.43.192.163:3001
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 25
      name: Ramp up load
    - duration: 80
      arrivalRate: 20
      rampTo: 100
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
scenarios:
  - flow:
      - loop:
        - post:
            url: "/dm"
            headers:
              x-user-id: "test|123"
            json:
              message: "testing, testing, 1, 2, 3"
              receiver_id: "test|456"
        - get:
            url: "/dm/test|456"
            headers:
              x-user-id: "test|123"
        - think: 1
        count: 10